ErpTest/src/Documents/уатВыручкаВодителей/уатВыручкаВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатВыручкаВодителей</name>
  <comment>(уат)</comment>
  <basedOn>Document.уатПутевойЛист</basedOn>
  <registerRecords>AccumulationRegister.уатВыручка</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевойЛист</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество пассажиров</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/Documents/уатВыручкаВодителей/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.уатВыручкаВодителей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	уатПроведение_проф.ОтразитьВыручку(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.уатВыручкаВодителей.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		Организация = Основание.Организация;
		Ответственный = Основание.Ответственный;
		Сотрудник = Основание.Водитель1;
		ПутевойЛист = Основание.Ссылка;
		Дата = Основание.Дата;
		
		//проверка уникальности номера
		Если ЗначениеЗаполнено(Номер) Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	уатВыручкаВодителей.Ссылка
			|ИЗ
			|	Документ.уатВыручкаВодителей КАК уатВыручкаВодителей
			|ГДЕ
			|	уатВыручкаВодителей.Номер = &Номер
			|	И уатВыручкаВодителей.Ссылка <> &Ссылка
			|	И уатВыручкаВодителей.Дата МЕЖДУ &НачПериода И &КонПериода");
			Запрос.УстановитьПараметр("Номер", Номер);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("НачПериода", НачалоГода(Дата));
			Запрос.УстановитьПараметр("КонПериода", КонецГода(Дата));
			Если НЕ Запрос.Выполнить().Пустой() Тогда
				Номер = "";
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из Основание.Задание Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Маршрут) Тогда
				Маршрут = ТекСтрока.Маршрут;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
